; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v3 ?v1)
             (pred_3 ?v12 ?v2)
             (pred_7 ?v3 ?v2)
             (pred_11 ?v10 ?v3 )
	     (pred_12 ?v3)
             (pred_10 ?v9)
             (pred_8 ?v12)
             (pred_1 ?v2)
             (pred_9 ?v3)
             (pred_6 ?v12)
             (pred_5 ?v3)
             (pred_2 ))



(:action op_5
:parameters (?v13 ?v7 ?v8 ?v11)
:precondition (and (pred_10 ?v13) (pred_10 ?v7) (pred_8 ?v8) (pred_1 ?v11)
          (pred_4 ?v13 ?v7) (pred_3 ?v8 ?v11)
                   (pred_7 ?v7 ?v11) (pred_12 ?v13) 
                   (pred_9 ?v7) (pred_6 ?v8))
:effect (and  (pred_5 ?v7) (not (pred_9 ?v7))))


(:action op_4
:parameters (?v13 ?v5)
:precondition (and (pred_10 ?v13) (pred_10 ?v5)
               (pred_12 ?v13) (pred_4 ?v13 ?v5) (pred_5 ?v5))
:effect (and (pred_12 ?v5) (not (pred_12 ?v13))))

(:action op_1
:parameters (?v13 ?v8)
:precondition (and (pred_10 ?v13) (pred_8 ?v8) 
                  (pred_12 ?v13) (pred_11 ?v8 ?v13) (pred_2 ))
:effect (and (pred_6 ?v8)
   (not (pred_11 ?v8 ?v13)) (not (pred_2 ))))


(:action op_2
:parameters (?v13 ?v6 ?v4)
:precondition (and (pred_10 ?v13) (pred_8 ?v6) (pred_8 ?v4)
                  (pred_12 ?v13) (pred_6 ?v4) (pred_11 ?v6 ?v13))
:effect (and (pred_6 ?v6) (pred_11 ?v4 ?v13)
        (not (pred_6 ?v4)) (not (pred_11 ?v6 ?v13))))

(:action op_3
:parameters (?v13 ?v8)
:precondition (and (pred_10 ?v13) (pred_8 ?v8) 
                  (pred_12 ?v13) (pred_6 ?v8))
:effect (and (pred_2 ) (pred_11 ?v8 ?v13) (not (pred_6 ?v8)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_15 obj_04 obj_11 obj_07 obj_03 obj_16 obj_08 obj_10 obj_17 obj_19 obj_06 obj_14 obj_12 obj_02 obj_20 obj_13
    obj_18 obj_01
    obj_09 obj_05
    )

    (:init
       (pred_2)

       (pred_10 obj_15)
       (pred_10 obj_04)
       (pred_10 obj_11)
       (pred_10 obj_07)
       (pred_10 obj_03)
       (pred_10 obj_16)
       (pred_10 obj_08)
       (pred_10 obj_10)
       (pred_10 obj_17)
       (pred_10 obj_19)
       (pred_10 obj_06)
       (pred_10 obj_14)
       (pred_10 obj_12)
       (pred_10 obj_02)
       (pred_10 obj_20)
       (pred_10 obj_13)
       (pred_1 obj_18)
       (pred_1 obj_01)
       (pred_8 obj_09)
       (pred_8 obj_05)

       (pred_4 obj_15 obj_03)
       (pred_4 obj_15 obj_04)
       (pred_4 obj_04 obj_16)
       (pred_4 obj_04 obj_11)
       (pred_4 obj_04 obj_15)
       (pred_4 obj_11 obj_08)
       (pred_4 obj_11 obj_07)
       (pred_4 obj_11 obj_04)
       (pred_4 obj_07 obj_10)
       (pred_4 obj_07 obj_11)
       (pred_4 obj_03 obj_17)
       (pred_4 obj_03 obj_16)
       (pred_4 obj_03 obj_15)
       (pred_4 obj_16 obj_19)
       (pred_4 obj_16 obj_08)
       (pred_4 obj_16 obj_04)
       (pred_4 obj_16 obj_03)
       (pred_4 obj_08 obj_06)
       (pred_4 obj_08 obj_10)
       (pred_4 obj_08 obj_11)
       (pred_4 obj_08 obj_16)
       (pred_4 obj_10 obj_14)
       (pred_4 obj_10 obj_07)
       (pred_4 obj_10 obj_08)
       (pred_4 obj_17 obj_12)
       (pred_4 obj_17 obj_19)
       (pred_4 obj_17 obj_03)
       (pred_4 obj_19 obj_02)
       (pred_4 obj_19 obj_06)
       (pred_4 obj_19 obj_16)
       (pred_4 obj_19 obj_17)
       (pred_4 obj_06 obj_20)
       (pred_4 obj_06 obj_14)
       (pred_4 obj_06 obj_08)
       (pred_4 obj_06 obj_19)
       (pred_4 obj_14 obj_13)
       (pred_4 obj_14 obj_10)
       (pred_4 obj_14 obj_06)
       (pred_4 obj_12 obj_02)
       (pred_4 obj_12 obj_17)
       (pred_4 obj_02 obj_20)
       (pred_4 obj_02 obj_19)
       (pred_4 obj_02 obj_12)
       (pred_4 obj_20 obj_13)
       (pred_4 obj_20 obj_06)
       (pred_4 obj_20 obj_02)
       (pred_4 obj_13 obj_14)
       (pred_4 obj_13 obj_20)
       (pred_9 obj_17)
       (pred_9 obj_04)
       (pred_7  obj_17 obj_18)
       (pred_7  obj_04 obj_01)
       (pred_5 obj_15)
       (pred_5 obj_11)
       (pred_5 obj_07)
       (pred_5 obj_03)
       (pred_5 obj_16)
       (pred_5 obj_08)
       (pred_5 obj_10)
       (pred_5 obj_19)
       (pred_5 obj_06)
       (pred_5 obj_14)
       (pred_5 obj_12)
       (pred_5 obj_02)
       (pred_5 obj_20)
       (pred_5 obj_13)

       (pred_3  obj_09 obj_18)
       (pred_3  obj_05 obj_01)
       (pred_11 obj_09 obj_06)
       (pred_11 obj_05 obj_11)
       (pred_12 obj_19)
    )

    (:goal (and
       (pred_11 obj_09 obj_03)
    ))
(:constraints
  (always (not (pred_12 obj_08)))
)
)

; plan
1. (op_4 obj_19 obj_06)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_06)
   goals met: 0 of 1
2. (op_1 obj_06 obj_09)
   deleted: (pred_11 obj_09 obj_06) (pred_2)
   added: (pred_6 obj_09)
   goals met: 0 of 1
3. (op_4 obj_06 obj_19)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_19)
   goals met: 0 of 1
4. (op_4 obj_19 obj_16)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_16)
   goals met: 0 of 1
5. (op_4 obj_16 obj_03)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_03)
   goals met: 0 of 1
6. (op_3 obj_03 obj_09)
   deleted: (pred_6 obj_09)
   added: (pred_2) (pred_11 obj_09 obj_03)
   goals met: 1 of 1
